#+TITLE: C FUNDAMENTALS PRACTICE - PRINTF
#+AUTHOR: Marcus Birkenkrahe (pledged)
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :results output :exports both
#+STARTUP: hideblocks overview indent
* README

- This file is a practice file for C input function ~printf~

- Time: approx. 30-45 min.

- When you're done with a section move the cursor on the section
  heading and type ~S-<right>~ (or SHIFT+<right-arrow>).

* DONE Identify yourself

- Replace the placeholder ~[yourName]~ in the header of this file by
  your name, add ~(pledged)~, and save the file (~C-x C-s~).

* DONE Conversion specification

Recreate the output below exactly, using only format specifiers (no
extra white space). The ruler is already prepared for you.

#+begin_example
: ....|....|....|
:   100100
: 200200
:        3.1416
: 3.141593
#+end_example

Code:
#+begin_src C
  printf("....|....|....|\n");
  printf("%8i\n",100100);
  printf("%i\n",200200); // `%6i` would work too
  printf("%13.4f\n",3.141593);
  printf("%.6f\n",3.141593); // `%6.6f` would work too
#+end_src

  #+RESULTS:
  : ....|....|....|
  :   100100
  : 200200
  :        3.1416
  : 3.141593

* DONE Integer decimal ~d~

Show that the default for ~d~ is p=1. Print the numbers 1, 1, 100 and
10000 with the specifiers ~%d~, ~%.1d~, ~%.5d~, ~%.2d~. Print each expression
on its own line, but use only ONE ~printf~ statement.

#+begin_src C :results output
  printf("....|....|....|\n");
  printf("%d\n%.1d\n%.5d\n%.2d",1,1,100,10000); // for 10000, p=2 is irrelevant
#+end_src

#+RESULTS:
: ....|....|....|
: 1
: 1
: 00100
: 10000

* DONE Integer decimal precision ~p~

Print the number 42 on a space of 10 characters with precision 5.

The result should look like this:
#+begin_example
: ....|....|....|
:      00042
#+end_example

Code:
#+begin_src C :results output
  printf("....|....|....|\n");
  printf("%10.5i\n",42);
#+end_src

#+RESULTS:
: ....|....|....|
:      00042

* DONE Scientific notation ~e~

- Print 1, 1000.100, and 1,000,000,000,000,000 using ~%e~ or =%E=.
- Provide for the required number of decimal positions (but not more).
- Print each expression on its own line with its own ~printf~ function.

Desired output:
#+begin_example
    : 1e+00
    : 1.0001e+03
    : 1E+15
#+end_example

Code:
#+begin_src C
  printf("%.e\n",1.);
  printf("%.4e\n",1000.100);
  printf("%.E\n",1000000000000000.);
#+end_src

#+RESULTS:
: 1e+00
: 1.0001e+03
: 1E+15

* DONE Variable floating point ~g~

- Use the format specifier ~g~ to display the following numbers: 
  1) ~200~
  2) ~3.142574654~ with ~p=8~, 
  3) ~2.71~
  4) ~!5~

- Desired output:
  #+begin_example
  200
  3.1425747
  2.71
  120
  #+end_example

- ~!N~ is defined as the factorial of ~N~: $N \times (N-1) \times \dots \times 1$.

Code:
#+begin_src C :results output
  printf("%g\n", 200.);
  printf("%.8g\n", 3.142574654); // %g not the best choice here
  printf("%g\n", 2.71);
  printf("%g\n", 5.*4.*3.*2.);
#+end_src

#+RESULTS:
: 200
: 3.1425747
: 2.71
: 120

* TODO Upload the completed file to Canvas now!
